day1/test2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-09 Mon 17:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Test2</title>
<meta name="author" content="Abhishek Raj" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Test2</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9204d20">1. Performance Metrics</a>
<ul>
<li><a href="#orgc4d83ea">1.1. 1. Performance Metrics Overview</a></li>
<li><a href="#orgd762b75">1.2. 2. Speedup</a></li>
<li><a href="#orgc745378">1.3. 3. Efficiency</a></li>
<li><a href="#org9416f85">1.4. 4. Amdahl&rsquo;s Law</a></li>
<li><a href="#org740357a">1.5. 5. Weak and Strong Scalability</a></li>
<li><a href="#org461879d">1.6. 6. Performance/Watt</a></li>
<li><a href="#org47dad07">1.7. 7. Arithmetic Intensity (FLOPS/Bytes)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9204d20" class="outline-2">
<h2 id="org9204d20"><span class="section-number-2">1.</span> Performance Metrics</h2>
<div class="outline-text-2" id="text-1">
<p>
In this module, we&rsquo;ll learn about different performance metrics used to measure the efficiency and scalability of computer systems. These metrics help us understand how well a system performs and where improvements can be made.
</p>
</div>
<div id="outline-container-orgc4d83ea" class="outline-3">
<h3 id="orgc4d83ea"><span class="section-number-3">1.1.</span> 1. Performance Metrics Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Performance metrics are used to evaluate how well a system performs in terms of speed, resource usage, and efficiency. Some common metrics are:
</p>
<ul class="org-ul">
<li>Execution Time (Time taken to run a task)</li>
<li>Throughput (Amount of work done in a unit of time)</li>
<li>Latency (Time to complete a task)</li>
<li>Energy consumption (Power used over time)</li>
</ul>
</div>
</div>
<div id="outline-container-orgd762b75" class="outline-3">
<h3 id="orgd762b75"><span class="section-number-3">1.2.</span> 2. Speedup</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Speedup is a way to compare how fast a parallel system is compared to a single processor.
</p>

<ul class="org-ul">
<li><p>
<b><b>Definition:</b></b> Speedup is the ratio of the time it takes to complete a task sequentially to the time it takes when running it in parallel.
</p>

<p>
\[
  \text{Speedup} = \frac{T_{\text{sequential}}}{T_{\text{parallel}}}
  \]
</p></li>

<li><p>
<b><b>Example:</b></b>
</p>

<p>
If a task takes 100 seconds to complete sequentially and 25 seconds when done in parallel on 4 processors, the speedup is:
</p>

<p>
\[
  \text{Speedup} = \frac{100}{25} = 4
  \]
</p>

<p>
This means the parallel system is 4 times faster than the sequential one.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orgc745378" class="outline-3">
<h3 id="orgc745378"><span class="section-number-3">1.3.</span> 3. Efficiency</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Efficiency shows how well the processors are being used in a parallel system.
</p>

<ul class="org-ul">
<li><p>
<b><b>Definition:</b></b> Efficiency is the speedup divided by the number of processors used.
</p>

<p>
\[
  \text{Efficiency} = \frac{\text{Speedup}}{P}
  \]
</p>

<p>
Where \( P \) is the number of processors.
</p></li>

<li><p>
<b><b>Example:</b></b>
</p>

<p>
From the previous example, if there are 4 processors:
</p>

<p>
\[
  \text{Efficiency} = \frac{4}{4} = 1
  \]
</p>

<p>
This means the system is fully using all 4 processors. If the speedup was 3 instead of 4, efficiency would be:
</p>

<p>
\[
  \text{Efficiency} = \frac{3}{4} = 0.75
  \]
</p>

<p>
This would mean that some processors are not being fully used.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org9416f85" class="outline-3">
<h3 id="org9416f85"><span class="section-number-3">1.4.</span> 4. Amdahl&rsquo;s Law</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Amdahl&rsquo;s Law helps us understand the maximum speedup we can achieve when only part of a program can be parallelized.
</p>

<ul class="org-ul">
<li><p>
<b><b>Definition:</b></b> Amdahl’s Law is used to predict the speedup based on how much of a program can be parallelized.
</p>

<p>
\[
  S = \frac{1}{(1 - P) + \frac{P}{N}}
  \]
</p>

<p>
Where:
</p>
<ul class="org-ul">
<li>\( S \) is the speedup,</li>
<li>\( P \) is the part of the program that can be parallelized,</li>
<li>\( N \) is the number of processors.</li>
</ul></li>

<li><p>
<b><b>Example:</b></b>
</p>

<p>
If 90% of a program can be parallelized and it runs on 4 processors:
</p>

<p>
\[
  S = \frac{1}{(1 - 0.9) + \frac{0.9}{4}} = \frac{1}{0.1 + 0.225} = \frac{1}{0.325} \approx 3.08
  \]
</p>

<p>
The maximum speedup in this case is about 3.08, even though 90% of the program can be parallelized.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org740357a" class="outline-3">
<h3 id="org740357a"><span class="section-number-3">1.5.</span> 5. Weak and Strong Scalability</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Scalability refers to how well a system can handle more work or processors.
</p>

<ul class="org-ul">
<li><b><b>Strong Scalability:</b></b> This measures how the execution time changes when we add more processors to a fixed problem size.</li>

<li><b><b>Weak Scalability:</b></b> This measures how well the system performs when both the problem size and the number of processors are increased together.</li>
</ul>
</div>
</div>
<div id="outline-container-org461879d" class="outline-3">
<h3 id="org461879d"><span class="section-number-3">1.6.</span> 6. Performance/Watt</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Performance per watt measures how efficiently a system performs relative to the amount of energy it consumes. This is important in systems where energy efficiency is a concern, like in mobile devices.
</p>

<ul class="org-ul">
<li><p>
<b><b>Definition:</b></b> It is the ratio of performance (like FLOPS) to power usage (in watts).
</p>

<p>
\[
  \text{Performance/Watt} = \frac{\text{Performance}}{\text{Power (W)}}
  \]
</p></li>

<li><p>
<b><b>Example:</b></b>
</p>

<p>
If a system performs 1 billion floating-point operations per second (1 GFLOPS) and consumes 100 watts of power:
</p>

<p>
\[
  \text{Performance/Watt} = \frac{1 \text{ GFLOPS}}{100 \text{ W}} = 0.01 \text{ GFLOPS/W}
  \]
</p>

<p>
This means the system performs 0.01 GFLOPS for each watt of power it uses.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org47dad07" class="outline-3">
<h3 id="org47dad07"><span class="section-number-3">1.7.</span> 7. Arithmetic Intensity (FLOPS/Bytes)</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Arithmetic intensity is a measure of how much work a program does compared to how much data it moves.
</p>

<ul class="org-ul">
<li><p>
<b><b>Definition:</b></b> It is the ratio of the number of floating-point operations to the amount of data moved in bytes.
</p>

<p>
\[
  \text{Arithmetic Intensity} = \frac{\text{FLOPS}}{\text{Bytes}}
  \]
</p></li>

<li><p>
<b><b>Example:</b></b>
</p>

<p>
If a program performs 10^9 floating-point operations and moves 10^8 bytes of data, its arithmetic intensity is:
</p>

<p>
\[
  \text{Arithmetic Intensity} = \frac{10^9}{10^8} = 10
  \]
</p>

<p>
This means the program performs 10 floating-point operations for each byte of data it moves.
</p></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhishek Raj</p>
<p class="date">Created: 2024-12-09 Mon 17:48</p>
</div>
</body>
</html>
